{
  "_class_name": "LongCatImagePipeline",
  "_diffusers_version": "0.35.1",
  "scheduler": [
    "diffusers",
    "FlowMatchEulerDiscreteScheduler"
  ],
  "text_encoder": [
    "transformers",
    "Qwen2_5_VLForConditionalGeneration"
  ],
  "tokenizer": [
    "transformers",
    "Qwen2Tokenizer"
  ],
  "vae": [
    "diffusers",
    "AutoencoderKL"
  ]
}
