{
    "_class_name": "LongCatImageTransformer2DModel",
    "_diffusers_version": "0.30.0.dev0",
    "attention_head_dim": 128,
    "guidance_embeds": false,
    "in_channels": 64,
    "joint_attention_dim": 3584,
    "num_attention_heads": 24,
    "num_layers": 10,
    "num_single_layers": 20,
    "patch_size": 1,
    "pooled_projection_dim": 3584
  }
  